CHRIS GLOCK

1.		EVALUATE PCT-GRADE
			WHEN 90 THRU 100 MOVE 'A' TO GRADE-OUT
			WHEN 80 THRU 89 MOVE 'B' TO GRADE-OUT
			WHEN 70 THRU 79 MOVE 'C' TO GRADE-OUT
			WHEN 60 THRU 69 MOVE 'D' TO GRADE-OUT
			WHEN OTHER MOVE 'U' TO GRADE-OUT
		END-EVALUATE.

2.		IF CUST-NUMBER NOT = CUST-HOLD
			PERFORM CONTROL-BREAK
		END-IF

		IF CUST-NUMBER = CUST-HOLD
			CONTINUE
		ELSE
			PERFORM CONTROL-BREAK
		END-IF

3.		05 PAY-CODE.
			88 SALARY VALUE 'S'.
			88 HOURLY VALUE 'H'.


		IF SALARY
			PERFORM 220-SALARIED-RTN
		ELSE
			IF HOURLY
				IF HOURS-WORKED > 40
					PERFORM 230-OVT-PAY
				ELSE
					PERFORM 240-REG-PAY
				END-IF
			END-IF
		END-IF

4.
		05 CURRENT-DATE VALUE 9(8).

		IF DATE-DUE < CURRENT-DATE
			PERFORM 210-PAST-DUE
		ELSE
			IF PAYMENT-IN > ACCT-BALANCE
				PERFORM 220-CREDIT-LETTER
			ELSE
				COMPUTE ACCT-BALANCE = ACCT-BALANCE - PAYMENT-IN
			END-IF
		END-IF

5.		IF EDUCATION-LEVEL = 'GRAD'
			IF YEARS-EMP > 2
				MOVE 'SENIOR PROGRAMMER' TO EMPLOYEE
			ELSE
				MOVE 'PROGRAMMER' TO EMPLOYEE
			END-IF
			MOVE 'GRADUATE' TO PRINT-REC
		ELSE
			IF YEARS-EMP > 3
				MOVE 'PROGRAMMER' TO EMPLOYEE
			ELSE
				MOVE 'JUNIOR PROGRAMMER' TO EMPLOYEE
			END-IF
			MOVE 'NON-GRAD' TO PRINT-REC
		END-IF

6.		EVALUATE IR-CURR-YEAR-PROD
			WHEN <= 1000 MOVE 25 TO WS-BONUS
			WHEN 1001 THRU 3000 MOVE 50 TO WS-BONUS
			WHEN 3001 THRU 6000 MOVE 100 TO WS-BONUS
			WHEN OTHER MOVE 200 TO WS-BONUS


7.		05 CR-WOOD-TYPE.
		   88 MAHOGANY VALUE 'MAHOGANY'.
		   88 OAK VALUE 'OAK'.
		   88 PINE VALUE 'PINE'.

		MOVE 200 TO CHARGE

		EVALUATE CR-WOOD-TYPE
			WHEN MAHOGANY ADD 150 TO CHARGE
			WHEN OAK ADD 125 TO CHARGE
		END-EVALUATE

		COMPUTE CR-SURFACE = CR-LEN * CR-WID

		IF CR-SURFACE > 750
			ADD 50 TO CHARGE
		END-IF

		COMPUTE CR-DRAWER-CHARGE = 	CR-NUM-OF-DRAWERS * 30
		ADD CR-DRAWER-CHARGE TO CHARGE
		MOVE CHARGE TO PRINT-REC.


